In [123]:
import pandas as pd

data = {"Name":["John","Peter","Lisa"],
        "Age":[25,28,31],
        "Salary":[300000,45000,25000]}

df = pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   John   25  300000
1  Peter   28   45000
2   Lisa   31   25000

In [124]:
data = pd.read_csv("C:/Users/hp/Downloads/hotel_bookings.csv")
print(data)

               hotel  is_canceled  lead_time  arrival_date_year  \
0       Resort Hotel            0        342               2015
1       Resort Hotel            0        737               2015
2       Resort Hotel            0          7               2015
3       Resort Hotel            0         13               2015
4       Resort Hotel            0         14               2015
...              ...          ...        ...                ...
119385    City Hotel            0         23               2017
119386    City Hotel            0        102               2017
119387    City Hotel            0         34               2017
119388    City Hotel            0        109               2017
119389    City Hotel            0        205               2017

       arrival_date_month  arrival_date_week_number  \
0                    July                        27
1                    July                        27
2                    July                        27
3                    July                        27
4                    July                        27
...                   ...                       ...
119385             August                        35
119386             August                        35
119387             August                        35
119388             August                        35
119389             August                        35

        arrival_date_day_of_month  stays_in_weekend_nights  \
0                               1                        0
1                               1                        0
2                               1                        0
3                               1                        0
4                               1                        0
...                           ...                      ...
119385                         30                        2
119386                         31                        2
119387                         31                        2
119388                         31                        2
119389                         29                        2

        stays_in_week_nights  adults  ...  deposit_type  agent company  \
0                          0       2  ...    No Deposit    NaN     NaN
1                          0       2  ...    No Deposit    NaN     NaN
2                          1       1  ...    No Deposit    NaN     NaN
3                          1       1  ...    No Deposit  304.0     NaN
4                          2       2  ...    No Deposit  240.0     NaN
...                      ...     ...  ...           ...    ...     ...
119385                     5       2  ...    No Deposit  394.0     NaN
119386                     5       3  ...    No Deposit    9.0     NaN
119387                     5       2  ...    No Deposit    9.0     NaN
119388                     5       2  ...    No Deposit   89.0     NaN
119389                     7       2  ...    No Deposit    9.0     NaN

       days_in_waiting_list customer_type     adr  \
0                         0     Transient    0.00
1                         0     Transient    0.00
2                         0     Transient   75.00
3                         0     Transient   75.00
4                         0     Transient   98.00
...                     ...           ...     ...
119385                    0     Transient   96.14
119386                    0     Transient  225.43
119387                    0     Transient  157.71
119388                    0     Transient  104.40
119389                    0     Transient  151.20

        required_car_parking_spaces  total_of_special_requests  \
0                                 0                          0
1                                 0                          0
2                                 0                          0
3                                 0                          0
4                                 0                          1
...                             ...                        ...
119385                            0                          0
119386                            0                          2
119387                            0                          4
119388                            0                          0
119389                            0                          2

        reservation_status reservation_status_date
0                Check-Out              2015-07-01
1                Check-Out              2015-07-01
2                Check-Out              2015-07-02
3                Check-Out              2015-07-02
4                Check-Out              2015-07-03
...                    ...                     ...
119385           Check-Out              2017-09-06
119386           Check-Out              2017-09-07
119387           Check-Out              2017-09-07
119388           Check-Out              2017-09-07
119389           Check-Out              2017-09-07

[119390 rows x 32 columns]

In [125]:
data = pd.read_excel("C:/Users/hp/Downloads/Telegram Desktop/banking Data.xlsx")
#print(data)
#print(data.head(10))
print(data.tail(10))

     Client ID              Name  Age     Sex  Location ID Joined Bank  \
2990  PKR19589       Jane Parker   49  Female        27490  1996-05-22
2991  PKR54576       Heather Day   70    Male         7006  2002-09-17
2992  PKR47226      Steven Welch   56    Male        14369  2017-04-17
2993  PKR33338       Samuel Carr   85    Male        21725  2007-11-08
2994  PKR24309   Daniel Marshall   52  Female         6198  1993-01-21
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                            Occupation  \
2990           Shawn Long       Asian                          Developer II
2991       Anthony Torres       Asian  Business Systems Development Analyst
2992        Samuel Fowler       Asian                     Financial Advisor
2993       James Castillo    American                   Software Consultant
2994          Paul Holmes    European                   Marketing Assistant
2995       Joshua Bennett    American              Accounting Assistant III
2996          Dennis Ruiz    European                             Paralegal
2997          Joshua Ryan    American                       Statistician IV
2998  Nicholas Cunningham    European         Human Resources Assistant III
2999           Joe Hanson    American                   Biostatistician III

     Investment Advisor  ... Amount of Credit Cards Credit Card Balance  \
2990      Carl Anderson  ...                      1           4241.5100
2991     Daniel Carroll  ...                      1            897.3900
2992   Lawrence Sanchez  ...                      1           5056.3590
2993       Sean Vasquez  ...                      1           5063.3100
2994      Ernest Knight  ...                      1           4327.9104
2995     Daniel Carroll  ...                      1            649.8540
2996     Peter Castillo  ...                      1           1639.0350
2997      Steve Sanchez  ...                      1           2352.8448
2998       Juan Ramirez  ...                      2           3578.6088
2999     Peter Castillo  ...                      1           1494.6876

       Bank Loans  Bank Deposits  Checking Accounts  Saving Accounts  \
2990  895255.9700   1.184494e+06      762894.128640    134911.803802
2991  308856.1320   2.038548e+05      254818.453500     73047.956670
2992  438838.1886   1.363870e+06      556681.708800    296896.911360
2993  518109.4800   9.511219e+05      260677.841220    301822.668050
2994  990326.1054   8.382616e+05      630618.820276     83057.112914
2995  223935.1380   1.089957e+06      532867.880160    657849.619325
2996  595902.0150   1.368913e+05       56581.744050     93195.608103
2997  880493.0256   2.148609e+05      158726.064384     35539.152952
2998  268625.0268   7.426302e+05      404638.261560     56411.334112
2999  285640.6572   6.561766e+04       77769.082368     32371.380536

      Foreign Currency Account  Business Lending  Properties Owned  \
2990                36303.5260      9.138633e+05                 3
2991                 7316.9460      3.739861e+05                 2
2992                50779.5477      6.570552e+05                 1
2993                 3154.9500      9.234595e+05                 3
2994                13537.0152      1.805960e+05                 3
2995                12947.3100      1.238860e+06                 1
2996                23205.6900      2.771711e+05                 1
2997                30291.8112      5.029472e+05                 2
2998                 6413.1444      1.538369e+06                 3
2999                 8992.3608      3.294125e+05                 1

      Risk Weighting
2990               2
2991               1
2992               2
2993               3
2994               5
2995               3
2996               2
2997               2
2998               1
2999               1

[10 rows x 25 columns]

In [126]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 25 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Client ID                 3000 non-null   object
 1   Name                      3000 non-null   object
 2   Age                       3000 non-null   int64
 3   Sex                       3000 non-null   object
 4   Location ID               3000 non-null   int64
 5   Joined Bank               3000 non-null   datetime64[ns]
 6   Banking Contact           3000 non-null   object
 7   Nationality               3000 non-null   object
 8   Occupation                3000 non-null   object
 9   Investment Advisor        3000 non-null   object
 10  Fee Structure             3000 non-null   object
 11  Loyalty Classification    3000 non-null   object
 12  Banking Relationship      3000 non-null   object
 13  Estimated Income          3000 non-null   float64
 14  Superannuation Savings    3000 non-null   float64
 15  Amount of Credit Cards    3000 non-null   int64
 16  Credit Card Balance       3000 non-null   float64
 17  Bank Loans                3000 non-null   float64
 18  Bank Deposits             3000 non-null   float64
 19  Checking Accounts         3000 non-null   float64
 20  Saving Accounts           3000 non-null   float64
 21  Foreign Currency Account  3000 non-null   float64
 22  Business Lending          3000 non-null   float64
 23  Properties Owned          3000 non-null   int64
 24  Risk Weighting            3000 non-null   int64
dtypes: datetime64[ns](1), float64(9), int64(5), object(10)
memory usage: 586.1+ KB
None

In [127]:
data.describe()

,Age,Location ID,Joined Bank,Estimated Income,Superannuation Savings,Amount of Credit Cards,Credit Card Balance,Bank Loans,Bank Deposits,Checking Accounts,Saving Accounts,Foreign Currency Account,Business Lending,Properties Owned,Risk Weighting
count,3000.000000,3000.000000,3000,3000.000000,3000.000000,3000.000000,3000.000000,3.000000e+03,3.000000e+03,3.000000e+03,3.000000e+03,3000.000000,3.000000e+03,3000.000000,3000.000000
mean,51.039667,21563.323000,2006-01-27 22:29:45.600000128,171305.034094,25531.599673,1.463667,3176.206780,5.913862e+05,6.715602e+05,3.210929e+05,2.329084e+05,29883.529774,8.667598e+05,1.518667,2.249333
min,17.000000,12.000000,1992-05-23 00:00:00,15919.475400,1482.030000,1.000000,1.174800,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,44.998400,0.000000e+00,0.000000,1.000000
25%,34.000000,10803.500000,1998-12-30 18:00:00,82906.594300,12513.775000,1.000000,1236.633525,2.396281e+05,2.044004e+05,1.199475e+05,7.479441e+04,11916.546400,3.748251e+05,1.000000,1.000000
50%,51.000000,21129.500000,2006-02-11 00:00:00,142313.479600,22357.355000,1.000000,2560.800750,4.797934e+05,4.633165e+05,2.428157e+05,1.640866e+05,24341.187200,7.113147e+05,2.000000,2.000000
75%,69.000000,32054.500000,2013-03-06 00:00:00,242290.306650,35464.740000,2.000000,4522.633050,8.258130e+05,9.427546e+05,4.348749e+05,3.155750e+05,41966.390700,1.185110e+06,2.000000,3.000000
max,85.000000,43369.000000,2019-09-12 00:00:00,522330.259200,75963.900000,3.000000,13991.994000,2.667557e+06,3.890598e+06,1.969923e+06,1.724118e+06,124704.866000,3.825962e+06,3.000000,5.000000
std,19.854760,12462.273017,NaN,111935.808260,16259.950770,0.676387,2497.094724,4.575570e+05,6.457169e+05,2.820796e+05,2.300078e+05,23109.924007,6.412303e+05,1.102145,1.131191

In [128]:
print(data.isnull().sum())

Client ID                   0
Name                        0
Age                         0
Sex                         0
Location ID                 0
Joined Bank                 0
Banking Contact             0
Nationality                 0
Occupation                  0
Investment Advisor          0
Fee Structure               0
Loyalty Classification      0
Banking Relationship        0
Estimated Income            0
Superannuation Savings      0
Amount of Credit Cards      0
Credit Card Balance         0
Bank Loans                  0
Bank Deposits               0
Checking Accounts           0
Saving Accounts             0
Foreign Currency Account    0
Business Lending            0
Properties Owned            0
Risk Weighting              0
dtype: int64

In [129]:
import pandas as pd
data = pd.read_csv("D:/company1.csv")
print(data)
print(data["salary"].mean())

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0
24400.0

In [130]:
print(data.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [131]:
print(data["EEID"].duplicated().sum())

2

In [132]:
print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [133]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [134]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [135]:
import numpy as np
print(data.replace(np.nan,30000))

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  30000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     30000      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [136]:
data["salary"] = data["salary"].replace(np.nan,24400)
print(data)
print(data["salary"].mean())

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0
24400.0

In [137]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [138]:
data = pd.read_csv("D:/company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [139]:
print(data.fillna(method = "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\hp\AppData\Local\Temp\ipykernel_9764\1391920301.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [140]:
print(data.fillna(method = "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\hp\AppData\Local\Temp\ipykernel_9764\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [141]:
print(data.fillna("hi"))

    EEID      Name gender   salary
0  EMP01    ayushi      F       hi
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali     hi  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05        hi      M  25000.0
5  EMP06     rohit      M       hi
6  EMP02     rohit      M  25000.0

In [142]:
df = pd.read_excel("D:/ESD.xlsx")
#print(data)
df.loc[(df["Bonus %"] == 0), "GetBonus"] = "no bonus"
df.loc[(df["Bonus %"] > 0), "GetBonus"] = "bonus"
print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date  GetBonus
0       0.15  United States    Seattle 2021-10-16     bonus
1       0.00          China  Chongqing        NaT  no bonus
2       0.20  United States    Chicago        NaT     bonus
3       0.07  United States    Chicago        NaT     bonus
4       0.00  United States    Phoenix        NaT  no bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  no bonus
996     0.00          China    Chengdu 2018-01-08  no bonus
997     0.15  United States      Miami        NaT     bonus
998     0.00          China    Chengdu        NaT  no bonus
999     0.31  United States      Miami        NaT     bonus

[1000 rows x 15 columns]

In [143]:
data = pd.read_excel("D:/ESD.xlsx")
#print(data)
data["Bonus"] = (data["Annual Salary"]/100)*20
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date    Bonus
0     0.15  United States    Seattle 2021-10-16  28320.8
1     0.00          China  Chongqing        NaT  19995.0
2     0.20  United States    Chicago        NaT  32619.8
3     0.07  United States    Chicago        NaT  16982.6
4     0.00  United States    Phoenix        NaT  19081.8
5     0.00          China  Chongqing        NaT  10198.8
6     0.10  United States    Phoenix        NaT  23949.2
7     0.00  United States      Miami 2021-05-20   8267.2
8     0.06  United States     Austin        NaT  22705.4
9     0.00  United States    Chicago        NaT  15440.6

In [144]:
data = {"Months":["January","February","March","April"]}
a = pd.DataFrame(data)
print(a)

def extract(value):
    return value[0:3]
    
a["Short_months"] = a["Months"].map(extract)
print(a)

     Months
0   January
1  February
2     March
3     April
     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

In [145]:
data = pd.read_excel("D:/ESD.xlsx")
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [146]:
gp = data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [147]:
gp1 = data.groupby("Country").agg({"Annual Salary":"max"})
print(gp1)

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498

In [148]:
gp1 = data.groupby("Country").agg({"Age":"mean"})
print(gp1)

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512

In [149]:
gp1 = data.groupby(["Country","Gender"]).agg({"Annual Salary":"max","Age":"max"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   65
              Male           249506   65
China         Female         249686   65
              Male           257194   65
United States Female         258498   65
              Male           258081   65

In [150]:
data1 = {"Emp Id" :["E01","E02","E03","E04","E05"],
         "Names" :["Ram","Shayam","Rahul","Vishal","Ravi"],
         "Age":[34,56,23,44,32]}
data2 = {"Emp Id" :["E01","E06","E03","E08","E05"],
         "Salary":[34000,56000,23000,44000,32000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02  Shayam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32

  Emp Id  Salary
0    E01   34000
1    E06   56000
2    E03   23000
3    E08   44000
4    E05   32000

In [151]:
print(pd.merge(df1,df2,on = "Emp Id"))

  Emp Id  Names  Age  Salary
0    E01    Ram   34   34000
1    E03  Rahul   23   23000
2    E05   Ravi   32   32000

In [152]:
print(pd.merge(df1,df2,on = "Emp Id",how="right"))

  Emp Id  Names   Age  Salary
0    E01    Ram  34.0   34000
1    E06    NaN   NaN   56000
2    E03  Rahul  23.0   23000
3    E08    NaN   NaN   44000
4    E05   Ravi  32.0   32000

In [153]:
print(pd.merge(df1,df2,on = "Emp Id",how="left"))

  Emp Id   Names  Age   Salary
0    E01     Ram   34  34000.0
1    E02  Shayam   56      NaN
2    E03   Rahul   23  23000.0
3    E04  Vishal   44      NaN
4    E05    Ravi   32  32000.0

In [154]:
data1 = {"Emp Id" :["E06","E07","E08","E09","E10"],
         "Names" :["Rama","Sha","Rahl","isha","kavi"],
         "Age":[34,56,23,44,32]}
data2 = {"Emp Id" :["E01","E02","E03","E04","E05"],
         "Names" :["Ram","Shayam","Rahul","Vishal","Ravi"],
         "Age":[34,56,23,44,32]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id Names  Age
0    E06  Rama   34
1    E07   Sha   56
2    E08  Rahl   23
3    E09  isha   44
4    E10  kavi   32

  Emp Id   Names  Age
0    E01     Ram   34
1    E02  Shayam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32

In [155]:
print(pd.concat([df1,df2]))

  Emp Id   Names  Age
0    E06    Rama   34
1    E07     Sha   56
2    E08    Rahl   23
3    E09    isha   44
4    E10    kavi   32
0    E01     Ram   34
1    E02  Shayam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32